app/controllers/houses_controller.rb

  def create
    @house = House.create(house_params)
---
INSERT INTO "houses" ("name", "author", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ravenclaw"], ["author", "JK Rowling"], ["source", "Harry Potter and the Sorcerer's Stone"], ["created_at", "2017-08-31 22:11:23.505565"], ["updated_at", "2017-08-31 22:11:23.505565"]]