app/controllers/members_controller.rb

INSERT INTO "members" ("first_name", "house_id", "created_at", "updated_at", "last_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["house_id", 282], ["created_at", "2017-09-01 02:32:43.107553"], ["updated_at", "2017-09-01 02:32:43.107553"], ["last_name", "Tully"]]
---
def create
  @house = House.find(params[:house_id])
  @member = Member.create(member_params)